[Killed] StringLiteral
mutation-testing/src/app/app.component.ts:9:11
   styleUrls: ['./app.component.scss']
 })
 export class AppComponent {
-  title = 'mutation-testing';
+  title = "";
   drink: "🧃" | "🍺" | undefined;
   model: {age?: number, name: string} =  {age: undefined, name: ''}
killedBy: AppComponent should have as title 'mutation-testing'
statusReason: Error: Expected '' to equal 'mutation-testing'.

[Survived] ObjectLiteral
mutation-testing/src/app/app.component.ts:11:42
 export class AppComponent {
   title = 'mutation-testing';
   drink: "🧃" | "🍺" | undefined;
-  model: {age?: number, name: string} =  {age: undefined, name: ''}
+  model: {age?: number, name: string} =  {}
   submitted = false;
 

[Survived] StringLiteral
mutation-testing/src/app/app.component.ts:11:65
 export class AppComponent {
   title = 'mutation-testing';
   drink: "🧃" | "🍺" | undefined;
-  model: {age?: number, name: string} =  {age: undefined, name: ''}
+  model: {age?: number, name: string} =  {age: undefined, name: "Stryker was here!"}
   submitted = false;
 

[Killed] BooleanLiteral
mutation-testing/src/app/app.component.ts:12:15
   title = 'mutation-testing';
   drink: "🧃" | "🍺" | undefined;
   model: {age?: number, name: string} =  {age: undefined, name: ''}
-  submitted = false;
+  submitted = true;
 
 
killedBy: AppComponent should not render the drink if person has not submitted
statusReason: Error: Expected 'Random can drink : ' to be undefined.

[Killed] BlockStatement
mutation-testing/src/app/app.component.ts:15:14
   submitted = false;
 
 
-  onSubmit() {
-    this.submitted = true;
-    const isAnAdult = this.model.age && this.model.age > 18;
-    if(isAnAdult){
-      this.drink = "🍺" ;
-    }
-    else{
-      this.drink = "🧃";
-    }
-   }
+  onSubmit() {}
 
 
killedBy: AppComponent should render 🧃 if person is less than 18 years young
statusReason: Error: Expected undefined to contain '🧃'.

[Killed] BooleanLiteral
mutation-testing/src/app/app.component.ts:16:22
 
 
   onSubmit() {
-    this.submitted = true;
+    this.submitted = false;
     const isAnAdult = this.model.age && this.model.age > 18;
     if(isAnAdult){
killedBy: AppComponent should render 🧃 if person is less than 18 years young
statusReason: Error: Expected undefined to contain '🧃'.

[Killed] ConditionalExpression
mutation-testing/src/app/app.component.ts:17:41
 
   onSubmit() {
     this.submitted = true;
-    const isAnAdult = this.model.age && this.model.age > 18;
+    const isAnAdult = this.model.age && false;
     if(isAnAdult){
       this.drink = "🍺" ;
killedBy: AppComponent should render 🍺  if person is more than 18 years young
statusReason: Error: Expected 'Random can drink : 🧃' to contain '🍺'.

[Killed] ConditionalExpression
mutation-testing/src/app/app.component.ts:17:23
 
   onSubmit() {
     this.submitted = true;
-    const isAnAdult = this.model.age && this.model.age > 18;
+    const isAnAdult = true;
     if(isAnAdult){
       this.drink = "🍺" ;
killedBy: AppComponent should render 🧃 if person is less than 18 years young
statusReason: Error: Expected 'Random can drink : 🍺' to contain '🧃'.

[Killed] ConditionalExpression
mutation-testing/src/app/app.component.ts:18:8
   onSubmit() {
     this.submitted = true;
     const isAnAdult = this.model.age && this.model.age > 18;
-    if(isAnAdult){
+    if(true){
       this.drink = "🍺" ;
     }
killedBy: AppComponent should render 🧃 if person is less than 18 years young
statusReason: Error: Expected 'Random can drink : 🍺' to contain '🧃'.

[Killed] BlockStatement
mutation-testing/src/app/app.component.ts:18:18
   onSubmit() {
     this.submitted = true;
     const isAnAdult = this.model.age && this.model.age > 18;
-    if(isAnAdult){
-      this.drink = "🍺" ;
-    }
+    if(isAnAdult){}
     else{
       this.drink = "🧃";
killedBy: AppComponent should render 🍺  if person is more than 18 years young
statusReason: Error: Expected 'Random can drink : ' to contain '🍺'.

[Killed] BlockStatement
mutation-testing/src/app/app.component.ts:21:9
     if(isAnAdult){
       this.drink = "🍺" ;
     }
-    else{
-      this.drink = "🧃";
-    }
+    else{}
    }
 
killedBy: AppComponent should render 🧃 if person is less than 18 years young
statusReason: Error: Expected 'Random can drink : ' to contain '🧃'.
